Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/quickstart--geomajas_quickstart.tmx
Source language: en
Languages: ja

source: Geomajas Quickstart
ja: Geomajasクイックスタート

source: Geomajas itself is an application framework allowing you to build very diverse and advanced web GIS solutions.
ja: Geomajas自身は、非常に多様で高度なWeb GISソリューションを構築できるアプリケーションフレームワークです。

source: On this OSGeo Live DVD we have included a ready-to-use Geomajas Application. This application features a map, navigation controllers, several data layers, a ribbon toolbar with GIS tools and the Layer Tree.
ja: このOSGeo Live DVDには、すぐに使用できるGeomajas Applicationが含まれています。このアプリケーションは、マップ、ナビゲーションコントローラ、複数のデータレイヤ、GISツールを含むリボンツールバー、およびレイヤツリーを特徴としています。

source: Start Geomajas
ja: Geomajasを開始

source: From the Desktop, select :menuselection:`Browser Clients --> Start Geomajas`. Wait for Geomajas to open in a browser window.
ja: デスクトップから:menuselection:`Browser Clients-->Start Geomajas`を選択します。Geomajasがブラウザウィンドウで開くまで待ちます。

source: Alternatively, you can then access the application using the following URL: `<http://localhost:8080/geomajas/>`_.
ja: あるいは、次のURLを使用してアプリケーションにアクセスすることもできます。`<http://localhost:8080/geomajas/>`_。

source: When you’re finished using the application, select :menuselection:`Browser Clients --> Stop Geomajas`.
ja: アプリケーションの使用が終了したら、:menuselection:`Browser Clients-->Stop Geomajas`を選択します。

source: Navigating the map
ja: マップのナビゲーション

source: You can drag the map with your mouse so that the desired area is centered on your screen.
ja: マップをマウスでドラッグすると、目的の領域が画面の中央に表示されます。

source: To get a closer look, you can either use the mousewheel to zoom in or use the provided zoom-buttons in the upper left of the application.
ja: よく見るには、マウスホイールを使用してズームインするか、アプリケーションの左上に表示されるズームボタンを使用します。

source: You can also select an area to display by clicking the magnifier icon and selecting the desired area (via rectangular select).
ja: 拡大アイコンをクリックして、表示する領域を選択することもできます(矩形選択)。

source: Understanding the legend
ja: 凡例について

source: In the upper right, a toggleable legend box is provided. This legend gives you an overview of all the layers currently loaded into the application, with the option to turn them on or off. This also shows more detailed information about each layer regarding icons and colouring.
ja: 右上に、切り替え可能な凡例ボックスが表示されます。この凡例は、アプリケーションにロードされているすべてのレイヤの概要を、オン/オフのオプション付きで示します。これにより、アイコンと色に関する各レイヤの詳細情報も表示されます。

source: Gathering information
ja: 情報の収集

source: Geomajas applications have the ability to display a variety of information within the layers. Clicking on the map will display the related information if available. Click the info icon in the upper left to toggle between basic or more detailed information.
ja: Geomajasアプリケーションには、レイヤー内のさまざまな情報を表示する機能があります。地図をクリックすると、関連情報が表示されます(利用可能な場合)。左上の情報アイコンをクリックして、基本情報と詳細情報を切り替えます。

source: Things to try
ja: 試してみること

source: If you want to use this sample application to build and customize your own Web GIS solution, visit `<http://www.geomajas.org/client-gwt>`_. The download page always features the latest and greatest sample applications, documentation, tips and tricks to roll-your-own.
ja: このサンプルアプリケーションを使用して独自のWeb GISソリューションを構築およびカスタマイズする場合は、`<http://www.geomajas.org/client-gwt>`_を参照してください。ダウンロードページには、常に最新で最高のサンプルアプリケーション、ドキュメント、独自のロールアップのためのヒントやトリックが掲載されています。

source: What next?
ja: 次のステップ

source: To continue using the web demo, visit `<http://www.geomajas.org/demo>`_.
ja: ウェブデモを継続するには、`<http://www.geomajas.org/demo>`_をご覧ください。

source: To continue using the stand-alone application, visit `<http://files.geomajas.org/downloads/2.3.0/geomajas-standalone-gwt2.zip>`_.
ja: スタンドアロンアプリケーションの使用を継続するには、`<http://files.geomajas.org/downloads/2.3.0/geomajas-standalone-gwt2. zip>`_を参照してください。

source: Interested in learning more about Geomajas? The following links provide more information:
ja: Geomajasについてもっと知りたいですか?詳細については、次のリンクを参照してください。
